Tekla Open API Reference for Tekla Structures 2025
ModelInfo.NorthDirection Property
 The north direction of the current Tekla Structures model.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double NorthDirection { get; set; }
Public Property NorthDirection As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
ModelInfo Class
Tekla.Structures.Model Namespace